admbase/src/Documents/ОтклоненияERP/ОтклоненияERP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтклоненияERP</name>
  <registerRecords>InformationRegister.УчетРабочегоВремениСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>CatalogRef.ТипыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>52</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремениСотрудников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВходДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрисутствиеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноРабочееВремяДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноРабочееВремяЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноСверхРабочееВремяДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноСверхРабочееВремяЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочееВремяЗаТерриториейДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочееВремяЗаТерриториейЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтпускБольничныйУвольнениеДатой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтпускБольничныйУвольнениеЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДатой</name>
    <comment>Время начала датой из ДО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияДатой</name>
    <comment>Время окончания датой из ДО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыход</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеЗаявкиНомерСтроки</name>
    <comment>Номер строки документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтсутствия</name>
    <type>
      <types>CatalogRef.ПричиныОтсутсвия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъяснительнаяЗаписка</name>
    <type>
      <types>DocumentRef.ОбъяснительнаяЗаписка</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаDMC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаDMC</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаERP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаERP</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>EnumRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DocumentRef.РасчетРабочегоВремени</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Enums/ЗаданияРасчета/ЗаданияРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗаданияРасчета</name>
  <enumValues>
    <name>ЗагрузкаДанныхПроходовРогачево</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанныхПроходовМосква</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДокументовERP</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДокументовDMC</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОбъяснений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольСпискаСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаГрафиковРаботы</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаИндивидуальныхГрафиковРаботы</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаСостоянияСотрудников</name>
  </enumValues>
  <enumValues>
    <name>РасчетРабочегоВремени</name>
  </enumValues>
</mdclass:Enum>

admbase/src/Documents/ОтклоненияERP/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//1. Разделяем данные на две таблицы  (Прогулы и Неявки по причинам)
//2. Из таблицы отгулы вытесняем даты таблицей с неявками по причинам
//3. Объединяем все в таблицу движений

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтклоненияERP.Дата КАК Дата,
	|	ТаблицаИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ТаблицаИсходныеДанные.ДатаНачала КАК ДатаНачала,
	|	ТаблицаИсходныеДанные.ТипДокумента КАК ТипДокумента,
	|	ТаблицаИсходныеДанные.Номер КАК НомерДокументаERP,
	|	ТаблицаИсходныеДанные.ДатаДокумента КАК ДатаДокументаERP,
	|	ТаблицаИсходныеДанные.НомерСтроки КАК СтрокаДокумента,
	|	ТипыДокументов.Наименование КАК ТипДокументаНаименование,
	|	ВЫБОР
	|		КОГДА ТаблицаИсходныеДанные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ТаблицаИсходныеДанные.ДатаНачала, КОНЕЦПЕРИОДА(ТаблицаИсходныеДанные.ДатаНачала, МЕСЯЦ), ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ТаблицаИсходныеДанные.ДатаНачала, ТаблицаИсходныеДанные.ДатаОкончания, ДЕНЬ)
	|	КОНЕЦ КАК РазностьДат
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.ОтклоненияERP.ИсходныеДанные КАК ТаблицаИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтклоненияERP КАК ОтклоненияERP
	|		ПО ТаблицаИсходныеДанные.Ссылка = ОтклоненияERP.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыДокументов КАК ТипыДокументов
	|		ПО ТаблицаИсходныеДанные.ТипДокумента = ТипыДокументов.Ссылка
	|ГДЕ
	|	ТаблицаИсходныеДанные.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеДанные.Дата КАК Дата,
	|	ИсходныеДанные.ДатаНачала КАК ДатаНачала,
	|	ИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ИсходныеДанные.ТипДокумента КАК ТипДокумента,
	|	ИсходныеДанные.НомерДокументаERP КАК НомерДокументаERP,
	|	ИсходныеДанные.ДатаДокументаERP КАК ДатаДокументаERP,
	|	ИсходныеДанные.СтрокаДокумента КАК СтрокаДокумента,
	|	ИсходныеДанные.ТипДокументаНаименование КАК ТипДокументаНаименование,
	|	ИсходныеДанные.РазностьДат КАК РазностьДат
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|ГДЕ
	|	ИсходныеДанные.ТипДокументаНаименование <> ""Отсутствие (болезнь, прогул, неявка)""";
	
	
	
	//Заполняем таблицу документально подтвержденных отсутствий
	ТаблицаДвижений = ИнициализироватьТаблицуЗначений();
	ЗаполнитьТаблицуДвиженийБезПрогулов(Запрос.Выполнить().Выбрать(),ТаблицаДвижений);
	
	//Заполняем таблицу прогулов
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсходныеДанные.Дата КАК Дата,
	|	ИсходныеДанные.ДатаНачала КАК ДатаНачала,
	|	ИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ИсходныеДанные.ТипДокумента КАК ТипДокумента,
	|	ИсходныеДанные.НомерДокументаERP КАК НомерДокументаERP,
	|	ИсходныеДанные.ДатаДокументаERP КАК ДатаДокументаERP,
	|	ИсходныеДанные.СтрокаДокумента КАК СтрокаДокумента,
	|	ИсходныеДанные.ТипДокументаНаименование КАК ТипДокументаНаименование,
	|	ИсходныеДанные.РазностьДат КАК РазностьДат
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|ГДЕ
	|	ИсходныеДанные.ТипДокументаНаименование = ""Отсутствие (болезнь, прогул, неявка)""";
		
	ТаблицаПрогулов = ИнициализироватьТаблицуЗначений();
	ЗаполнитьТаблицуДвиженийБезПрогулов(Запрос.Выполнить().Выбрать(),ТаблицаПрогулов);
	
	
	//Заполнение таблицы движений регистра
	Запрос.Текст = ТекстЗапросаТаблицыДвижений();
	Запрос.УстановитьПараметр("ТаблицаДвижений",ТаблицаДвижений);
	Запрос.УстановитьПараметр("ТаблицаПрогулов",ТаблицаПрогулов);
	
	
	Движения.УчетРабочегоВремениСотрудников.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.УчетРабочегоВремениСотрудников.Записывать = Истина;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;
	
	ЗаданияРасчета  = Перечисления.ЗаданияРасчета.ЗагрузкаДокументовERP;
	КонсолидацияРегистрЗаданий.ЗаписатьПервичныеДанныеВРегистрЗаданий(Отказ,ЗаданияРасчета,Ссылка,Дата,Проведен,ПометкаУдаления);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуДвиженийБезПрогулов(Выборка,ТаблицаДвижений)

	Пока Выборка.Следующий() Цикл
		
		Для Счетчик = 0 По Выборка.РазностьДат Цикл
			
			НовоеДвижение = ТаблицаДвижений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовоеДвижение,Выборка);
			НовоеДвижение.Дата 			= Выборка.ДатаНачала + (86400 * Счетчик);
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаТаблицыДвижений()

	Возврат "ВЫБРАТЬ
	|	ТаблицаДвижений.Сотрудник КАК Сотрудник,
	|	ТаблицаДвижений.Дата КАК Дата,
	|	ТаблицаДвижений.СтрокаДокумента КАК СтрокаДокумента,
	|	ТаблицаДвижений.ТипДокумента КАК ТипДокумента,
	|	ТаблицаДвижений.НомерДокументаERP КАК НомерДокументаERP,
	|	ТаблицаДвижений.ДатаДокументаERP КАК ДатаДокументаERP,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаДвижений
	|ИЗ
	|	&ТаблицаДвижений КАК ТаблицаДвижений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПрогулов.Сотрудник КАК Сотрудник,
	|	ТаблицаПрогулов.Дата КАК Дата,
	|	ТаблицаПрогулов.СтрокаДокумента КАК СтрокаДокумента,
	|	ТаблицаПрогулов.ТипДокумента КАК ТипДокумента,
	|	ТаблицаПрогулов.НомерДокументаERP КАК НомерДокументаERP,
	|	ТаблицаПрогулов.ДатаДокументаERP КАК ДатаДокументаERP,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаПрогулов
	|ИЗ
	|	&ТаблицаПрогулов КАК ТаблицаПрогулов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвижений.Сотрудник КАК Сотрудник,
	|	ТаблицаДвижений.Дата КАК Дата,
	|	ТаблицаДвижений.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ Приоритеты
	|ИЗ
	|	ТаблицаДвижений КАК ТаблицаДвижений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаПрогулов.Сотрудник,
	|	ТаблицаПрогулов.Дата,
	|	ТаблицаПрогулов.Приоритет
	|ИЗ
	|	ТаблицаПрогулов КАК ТаблицаПрогулов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Приоритеты.Сотрудник КАК Сотрудник,
	|	Приоритеты.Дата КАК Дата,
	|	МИНИМУМ(Приоритеты.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ Отсекающая
	|ИЗ
	|	Приоритеты КАК Приоритеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Приоритеты.Сотрудник,
	|	Приоритеты.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК ДокументДвижения,
	|	ТаблицаДвижений.Сотрудник КАК Сотрудник,
	|	ТаблицаДвижений.Дата КАК Дата,
	|	ТаблицаДвижений.СтрокаДокумента КАК СтрокаДокумента,
	|	ТаблицаДвижений.ТипДокумента КАК ТипДокумента,
	|	ТаблицаДвижений.НомерДокументаERP КАК НомерДокументаERP,
	|	ТаблицаДвижений.ДатаДокументаERP КАК ДатаДокументаERP,
	|	ТаблицаДвижений.Приоритет КАК Приоритет
	|ИЗ
	|	ТаблицаДвижений КАК ТаблицаДвижений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Отсекающая КАК Отсекающая
	|		ПО ТаблицаДвижений.Сотрудник = Отсекающая.Сотрудник
	|			И ТаблицаДвижений.Дата = Отсекающая.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Ссылка,
	|	ТаблицаПрогулов.Сотрудник,
	|	ТаблицаПрогулов.Дата,
	|	ТаблицаПрогулов.СтрокаДокумента,
	|	ТаблицаПрогулов.ТипДокумента,
	|	ТаблицаПрогулов.НомерДокументаERP,
	|	ТаблицаПрогулов.ДатаДокументаERP,
	|	ТаблицаПрогулов.Приоритет
	|ИЗ
	|	ТаблицаПрогулов КАК ТаблицаПрогулов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Отсекающая КАК Отсекающая
	|		ПО ТаблицаПрогулов.Сотрудник = Отсекающая.Сотрудник
	|			И ТаблицаПрогулов.Дата = Отсекающая.Дата
	|			И ТаблицаПрогулов.Приоритет = Отсекающая.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата";
		

КонецФункции // ТекстЗапросаТаблицыДвижений()

Функция ИнициализироватьТаблицуЗначений()

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаЗначений.Колонки.Добавить("Дата",новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("СтрокаДокумента",новый ОписаниеТипов("Число"));
	
	ТаблицаЗначений.Колонки.Добавить("ТипДокумента",новый ОписаниеТипов("СправочникСсылка.ТипыДокументов"));
	ТаблицаЗначений.Колонки.Добавить("НомерДокументаERP",новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("ДатаДокументаERP",новый ОписаниеТипов("Дата"));
	
	
	Возврат ТаблицаЗначений;
	
КонецФункции // ИнициализироватьТаблицуЗначений()
	
#КонецОбласти 

#КонецЕсли
